# Напишите функцию, которая принимает количество повторных запусков
# теста и значение таймаута. Количество повторных запусков должно
# находиться в диапазоне от 0 до 5, а таймаут должен быть положительным
# числом. Если переданные значения не соответствуют этим требованиям,
# самостоятельно создайте исключение ValueError с помощью raise и
# добавьте понятное описание причины ошибки. Вызов функции
# необходимо поместить в try/except и корректно обработать созданные
# исключения. Проверьте работу программы минимум на трёх наборах
# данных: корректные значения, отрицательный таймаут и слишком
# большое количество повторных запусков
#

def test_run(repeat, timeout):
    if repeat < 0 or repeat > 5:
        raise ValueError(f"Количество повтором должно быть от 0 до 5. Повторов: {repeat}")
    if timeout <= 0:
        raise ValueError(f"Таймаут должен быть положительным числом. Таймаут: {timeout}")

    print(f"\nПовторов: {repeat}, таймаут: {timeout}\n")


# Тест корректных значений

try:
    test_run(3, 5)
except ValueError as e:
    print(f"Ошибка: {e}\n")

# Тест отрицательного таймаута

try:
    test_run(3, -5)
except ValueError as e:
    print(f"Ошибка: {e}\n")

# Тест превышения количества повторов

try:
    test_run(6, 5)
except ValueError as e:
    print(f"Ошибка: {e}\n")


