# Создайте класс ATM, описывающий работу банкомата. Банкомат должен
# хранить количество купюр номиналом 20, 50 и 100. Начальное количество
# купюр каждого номинала передается при создании объекта через
# __init__().
# Реализуйте метод add_money(), позволяющий добавить в банкомат
# купюры каждого номинала. Также реализуйте метод withdraw(amount)
# для снятия указанной суммы. Метод должен определить, может ли
# банкомат выдать запрошенную сумму имеющимися купюрами. Если
# операция возможна, необходимо уменьшить количество купюр в
# банкомате, вывести, сколько купюр каждого номинала было выдано, и
# вернуть True. Если указанную сумму выдать невозможно — вернуть False
# и оставить содержимое банкомата без изменений.
# Создайте объект ATM, добавьте в него несколько купюр и выполните
# несколько операций снятия денег.
class ATM:
    def __init__(self, n20, n50, n100):
        self.n20 = n20
        self.n50 = n50
        self.n100 = n100

    def add_money(self, n20, n50, n100):
        self.n20 += n20
        self.n50 += n50
        self.n100 += n100
        print(f"Добавлено {n20} купюр номиналом 20, {n50} купюр номиналом 50,"
              f" {n100} купюр номиналом 100")

    def withdraw(self, amount):
        total_money = self.n20 * 20 + self.n50 * 50 + self.n100 * 100
        if amount > total_money:
            print("Недостаточно средств")
            return False

        give_100 = 0
        give_50 = 0
        give_20 = 0

        need = amount 

        take = min(self.n100, need // 100)  # 100 рублей сколько раз можно взять
        give100 = take
        need -= take * 100

        # 50 рублей
        take = min(self.n50, need // 50)
        give50 = take
        need -= take * 50

        # 20 рублей
        take = min(self.n20, need // 20)
        give20 = take
        need -= take * 20

        if need != 0: # если есть остаток, то не сможем выдать
            print(f"Нельзя выдать {amount}: не хватает купюр")
            return False

        self.n100 -= give100
        self.n50 -= give50
        self.n20 -= give20

        print(f"Выдали {amount} ₽: 100×{give100}, 50×{give50}, 20×{give20}")
        self.show_balance()
        return True

    def show_balance(self):
        total = self.n20 * 20 + self.n50 * 50 + self.n100 * 100
        print(f"В банкомате: 20×{self.n20}, 50×{self.n50}, 100×{self.n100} | Всего: {total} ₽\n")


atm = ATM(n20=5, n50=3, n100=4)
atm.show_balance()

atm.add_money(n20=10, n50=5, n100=2)

print("\n------------- Снимаем 270 --------------")
atm.withdraw(270)

print("------------- Снимаем 99 (не получится) ------------")
atm.withdraw(99)